; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-51)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 - object)
 (:init 
    (arm-empty)
    (clear b8)
    (on b8 b10)
    (on b10 b3)
    (on-table b3)
    (clear b9)
    (on b9 b15)
    (on b15 b13)
    (on b13 b6)
    (on b6 b1)
    (on b1 b7)
    (on b7 b12)
    (on b12 b11)
    (on b11 b5)
    (on b5 b2)
    (on b2 b4)
    (on-table b4)
    (clear b14)
    (on-table b14))
 (:goal (and 
(on-table b4)
(clear b14) (on b14 b1)
))
)

; plan
1. (unstack b9 b15)
   deleted: (on b9 b15) (clear b9) (arm-empty)
   added: (holding b9) (clear b15)
   goals met: 2 of 3
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 3
3. (unstack b15 b13)
   deleted: (on b15 b13) (clear b15) (arm-empty)
   added: (holding b15) (clear b13)
   goals met: 2 of 3
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 2 of 3
5. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 2 of 3
6. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 2 of 3
7. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 2 of 3
8. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 3
9. (pickup b14)
   deleted: (clear b14) (on-table b14) (arm-empty)
   added: (holding b14)
   goals met: 1 of 3
10. (stack b14 b1)
   deleted: (clear b1) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b1)
   goals met: 3 of 3
